[
  {
    "name": "Adjustable Dumbbells",
    "price": 150,
    "stock": 30,
    "description": "Adjustable dumbbells with a weight range from 5 to 50 lbs, perfect for strength training at home. These dumbbells offer a compact, all-in-one design, eliminating the need for multiple sets. The smooth, easy adjustment mechanism ensures quick and seamless weight changes. Durable construction and ergonomic handles provide a comfortable and secure grip.",
    "images": "https://images.pexels.com/photos/4793223/pexels-photo-4793223.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
    "category": "Strength",
    "featured": true,
    "quantity": 1,
    "rating": 4

  },
  {
    "name": "Treadmill",
    "price": 1200,
    "stock": 10,
    "description": "High-quality treadmill with multiple speed settings, heart rate monitor, and foldable design. This treadmill offers a variety of pre-programmed workouts to help you achieve your fitness goals. The large, cushioned running surface minimizes impact on your joints. Built-in speakers and Bluetooth connectivity allow you to enjoy your favorite music while exercising.",
    "images": 
      "https://images.pexels.com/photos/1954524/pexels-photo-1954524.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1"
    ,
    "category": "Cardio",
    "featured": true,
    "quantity": 1,
    "rating": 4
  },
  {
    "name": "Yoga Mat",
    "price": 30,
    "stock": 100,
    "description": "Non-slip yoga mat, 6mm thick, available in various colors. Ideal for yoga, pilates, and other floor exercises. The high-density material provides excellent cushioning and support. Easy to clean and lightweight, making it perfect for home or studio use. The textured surface ensures stability during poses.",
    "images": 
      "https://images.pexels.com/photos/3758056/pexels-photo-3758056.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1"
    ,
    "category": "Accessories",
    "featured": false,
    "quantity": 1,
    "rating": 3
  },
  {
    "name": "Kettlebell Set",
    "price": 200,
    "stock": 25,
    "description": "Set of 5 kettlebells ranging from 10 to 50 lbs. Perfect for full-body workouts. These kettlebells are ideal for exercises that build strength, endurance, and balance. The comfortable, non-slip handles ensure a secure grip during intense workouts. The set includes a stand for easy storage and organization.",
    "images": 
      "https://images.pexels.com/photos/416717/pexels-photo-416717.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1"
    ,
    "category": "Strength",
    "featured": false,
    "quantity": 1,
    "rating": 5
  },
  {
    "name": "Resistance Bands",
    "price": 25,
    "stock": 75,
    "description": "Set of 5 resistance bands with varying levels of resistance, great for strength training and rehabilitation exercises. These bands are made of durable, high-quality latex that maintains its elasticity over time. The set includes a convenient carrying bag for easy portability. Perfect for home workouts, gym sessions, and physical therapy.",
    "images": 
      "https://images.pexels.com/photos/6339636/pexels-photo-6339636.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1"
    ,
    "category": "Accessories",
    "featured": false,
    "quantity": 1,
    "rating": 4
  },
  {
    "name": "Exercise Bike",
    "price": 500,
    "stock": 15,
    "description": "Stationary exercise bike with adjustable seat, digital display, and multiple resistance levels. This bike features a smooth, quiet belt drive system for a pleasant riding experience. The ergonomic design ensures comfort during long workouts. Track your progress with the built-in monitor that displays time, speed, distance, and calories burned.",
    "images": 
      "https://hips.hearstapps.com/hmg-prod/images/bestexercisebikes-65e0e9b93bb86.jpg?crop=0.502xw:1.00xh;0.250xw,0&resize=640:*"
    ,
    "category": "Cardio",
    "featured": true,
    "quantity": 1,
    "rating": 5
  },
  {
    "name": "Foam Roller",
    "price": 20,
    "stock": 50,
    "description": "High-density foam roller for muscle massage, injury prevention, and recovery. This roller helps relieve muscle tension and improve circulation. It's perfect for post-workout recovery and physical therapy. The compact, lightweight design makes it easy to take with you to the gym or use at home.",
    "images": 
      "https://www.sixtusitalia.com/piuma/0_0_80:default/https://www.sixtusitalia.com/wp-content/uploads/sites/3/2024/05/foam-roller.png"
    ,
    "category": "Accessories",
    "featured": false,
    "quantity": 1,
    "rating": 4
  },
  {
    "name": "Pull-Up Bar",
    "price": 60,
    "stock": 40,
    "description": "Adjustable pull-up bar for doorways, suitable for pull-ups, chin-ups, and other upper body exercises. This bar can be easily installed without drilling, making it perfect for home use. The padded handles provide a comfortable grip, reducing strain on your hands. It supports multiple grip positions to target different muscle groups.",
    "images": 
      "https://cdn.thewirecutter.com/wp-content/media/2023/11/pullupbars-2048px-5859.jpg"
    ,
    "category": "Strength",
    "featured": false,
    "quantity": 1,
    "rating": 3
  },
  {
    "name": "Elliptical Machine",
    "price": 800,
    "stock": 8,
    "description": "Elliptical machine with smooth stride, heart rate monitor, and multiple workout programs. This machine offers a low-impact workout that is gentle on your joints. The large LCD display tracks your time, speed, distance, and calories burned. Built-in speakers and Bluetooth connectivity allow you to stay entertained while you exercise.",
    "images": 
      "https://gymsportz.sg/cdn/shop/articles/benefits-of-having-an-elliptical-machine-for-home-use-910021.jpg?v=1696456728"
    ,
    "category": "Cardio",
    "featured": false,
    "quantity": 1,
    "rating": 4
  },
  {
    "name": "Jump Rope",
    "price": 15,
    "stock": 150,
    "description": "High-speed jump rope with adjustable length, perfect for cardio workouts and agility training. The lightweight, durable design ensures long-lasting performance. The ergonomic handles provide a comfortable, secure grip. This jump rope is ideal for improving coordination, endurance, and cardiovascular health.",
    "images": 
      "https://cdn.cdnparenting.com/articles/2019/03/04134945/562323112-H.jpg"
    ,
    "category": "Accessories",
    "featured": false,
    "quantity": 1,
    "rating": 4
  },
  {
    "name": "Rowing Machine",
    "price": 700,
    "stock": 12,
    "description": "Compact rowing machine with adjustable resistance levels, built-in workout programs, and a digital monitor. This machine provides a full-body workout that targets multiple muscle groups. The comfortable seat and ergonomic handles ensure a smooth, enjoyable rowing experience. Easily foldable for convenient storage.",
    "images": 
      "https://www.anytimefitness.com/wp-content/uploads/2020/06/AnytimeFitness_21-Day-Rowing-Machine-Workout-Plan_HERO.jpg"
    ,
    "category": "Cardio",
    "featured": true,
    "quantity": 1,
    "rating": 3
  },
  {
    "name": "Medicine Ball",
    "price": 40,
    "stock": 60,
    "description": "10 lb medicine ball for strength training, core workouts, and functional fitness exercises. The textured surface provides a secure grip during dynamic movements. Perfect for exercises that improve coordination, balance, and explosive power. The durable construction ensures long-lasting use.",
    "images": 
      "https://m.media-amazon.com/images/I/71pKlgP7qwL._AC_UF1000,1000_QL80_.jpg"
    ,
    "category": "Strength",
    "featured": false,
    "quantity": 1,
    "rating": 5
  },
  {
    "name": "Foam Plyo Box",
    "price": 150,
    "stock": 20,
    "description": "Durable foam plyo box for plyometric training, available in three different heights. The soft foam construction reduces the risk of injury during intense workouts. The non-slip surface ensures stability during jumps and other exercises. Ideal for improving strength, speed, and agility.",
    "images": 
      "https://www.lifelinefitness.com/cdn/shop/files/lifelinefoampylobox-18_trainingequipment__llpb-18_9_800x.jpg?v=1707508862"
    ,
    "category": "Strength",
    "featured": false,
    "quantity": 1,
    "rating": 4
  },
  {
    "name": "Weight Bench",
    "price": 250,
    "stock": 18,
    "description": "Adjustable weight bench with multiple incline/decline positions for a variety of strength training exercises. This bench is perfect for bench presses, dumbbell exercises, and core workouts. The sturdy frame and comfortable padding provide excellent support. Easily foldable for convenient storage.",
    "images": 
      "https://cdn.mos.cms.futurecdn.net/dXKfAezfGDnfo2RuZbAgXa-1200-80.jpg"
    ,
    "category": "Strength",
    "featured": true,
    "quantity": 1,
    "rating": 5
  },
  {
    "name": "Speed Ladder",
    "price": 30,
    "stock": 70,
    "description": "Agility speed ladder for improving footwork, coordination, and speed, ideal for athletic training. This ladder is lightweight and portable, making it easy to set up anywhere. The adjustable rungs allow for customization to suit different training needs. Perfect for sports drills and functional fitness exercises.",
    "images": 
      "https://ruggers.com/cdn/shop/products/equipment-speed-ladder-1_956x.jpg?v=1562009280"
    ,
    "category": "Accessories",
    "featured": false,
    "quantity": 1,
    "rating": 4
  },
  {
    "name": "Power Rack",
    "price": 600,
    "stock": 10,
    "description": "Heavy-duty power rack with adjustable safety bars, pull-up bar, and multiple weight storage pegs. This rack is ideal for squats, bench presses, and other strength training exercises. The sturdy construction ensures stability and safety during workouts. The integrated pull-up bar adds versatility to your training routine.",
    "images": 
      "https://www.lsgfitness.com.au/cdn/shop/files/LGST-GRK100_media-02_1024x1024.jpg?v=1699830928"
    ,
    "category": "Strength",
    "featured": false,
    "quantity": 1,
    "rating": 5
  },
  {
    "name": "Battle Ropes",
    "price": 80,
    "stock": 25,
    "description": "30-foot battle ropes for high-intensity cardio and strength training workouts, complete with anchor kit. These ropes are made of durable, high-quality material that withstands intense use. The comfortable, non-slip handles provide a secure grip. Perfect for improving cardiovascular endurance, strength, and power.",
    "images": 
      "https://training-conditioning.com/wp-content/uploads/2022/10/fun-with-battle-ropes.jpeg"
    ,
    "category": "Accessories",
    "featured": false,
    "quantity": 1,
    "rating": 5
  },
  {
    "name": "Stability Ball",
    "price": 25,
    "stock": 50,
    "description": "65 cm stability ball for balance training, core workouts, and physical therapy exercises. The anti-burst design ensures safety during use. Perfect for improving flexibility, posture, and strength. The included pump makes it easy to inflate and deflate the ball.",
    "images": 
      "https://www.verywellfit.com/thmb/fprN_qazPelnEpPFVBCi8rzXdrA=/fit-in/1500x3517/filters:no_upscale():max_bytes(150000):strip_icc()/Exercise-Balls-Testing-2I6F0460.jpg-77b7f46927004be48e56a15f493fdb61.jpg"
    ,
    "category": "Accessories",
    "featured": false,
    "quantity": 1,
    "rating": 4
  },
  {
    "name": "Boxing Gloves",
    "price": 45,
    "stock": 35,
    "description": "12 oz boxing gloves with high-density foam padding and secure wrist straps, ideal for boxing and kickboxing. These gloves provide excellent protection and support during training. The breathable material ensures comfort and reduces sweat buildup. Perfect for beginners and experienced boxers alike.",
    "images": 
      "https://www.geezersboxing.co.uk/media/mageplaza/blog/post/s/h/shutterstock_781725871.jpg"
    ,
    "category": "Accessories",
    "featured": false,
    "quantity": 1,
    "rating": 4
  },
  {
    "name": "Ab Roller",
    "price": 20,
    "stock": 80,
    "description": "Compact ab roller with ergonomic handles for effective core strengthening exercises. This roller helps improve abdominal strength, stability, and endurance. The non-slip handles provide a comfortable, secure grip. Lightweight and portable, making it perfect for home or gym use.",
    "images": 
      "https://images.pexels.com/photos/8544604/pexels-photo-8544604.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1"
    ,
    "category": "Accessories",
    "featured": false,
    "quantity": 1,
    "rating": 5
  }
]
